; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl)

(:types link joint angle)
(:predicates
    (Connected ?j - joint ?l - link) 
    (AngleOrd ?a - angle ?a1 - angle)
    (HasAngle ?a - angle ?j - joint)
    (IsChildOf ?child - link ?parent - link)
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
    (IsChildOf ?link1 ?link2)
    (Connected ?joint ?link1)
    (Connected ?joint ?link2)
    (not (= ?link1 ?link2))
    (HasAngle ?a1 ?joint)
    (AngleOrd ?a1 ?a2)
    )
:effect (and 
    (not (HasAngle ?a1 ?joint)) 
    (HasAngle ?a2 ?joint)
    )
)

(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
    (IsChildOf ?link1 ?link2)
    (Connected ?joint ?link1)
    (Connected ?joint ?link2)
    (not (= ?link1 ?link2))
    (HasAngle ?a1 ?joint)
    (AngleOrd ?a2 ?a1)
    )
:effect (and 
    (not (HasAngle ?a1 ?joint)) 
    (HasAngle ?a2 ?joint)
    )
)
)

; problem
(define (problem joint_bar_9)
(:domain joint_bar)
(:objects
    link_ground link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 - link
    joint_ground joint1 joint2 joint3 joint4 joint5 joint6 joint7 joint8 joint9 - joint
    angle0 angle45 angle90 angle135 angle180 angle225 angle270 angle315 - angle)
(:init
    (AngleOrd angle0 angle45)
    (AngleOrd angle45 angle90)
    (AngleOrd angle90 angle135)
    (AngleOrd angle135 angle180)
    (AngleOrd angle180 angle225)
    (AngleOrd angle225 angle270)
    (AngleOrd angle270 angle315)
    (AngleOrd angle315 angle0)

    (IsChildOf link1 link_ground)
    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)
    (IsChildOf link10 link9)

    (Connected joint_ground link_ground)
    (Connected joint_ground link1)
    (Connected joint1 link1)
    (Connected joint1 link2)
    (Connected joint2 link2)
    (Connected joint2 link3)
    (Connected joint3 link3)
    (Connected joint3 link4)
    (Connected joint4 link4)
    (Connected joint4 link5)
    (Connected joint5 link5)
    (Connected joint5 link6)
    (Connected joint6 link6)
    (Connected joint6 link7)
    (Connected joint7 link7)
    (Connected joint7 link8)
    (Connected joint8 link8)
    (Connected joint8 link9)
    (Connected joint9 link9)
    (Connected joint9 link10)

    (HasAngle angle315 joint_ground)
    (HasAngle angle315 joint1)
    (HasAngle angle0 joint2)
    (HasAngle angle90 joint3)
    (HasAngle angle225 joint4)
    (HasAngle angle0 joint5)
    (HasAngle angle45 joint6)
    (HasAngle angle0 joint7)
    (HasAngle angle45 joint8)
    (HasAngle angle135 joint9)
)
(:goal
(and
    (HasAngle angle135 joint_ground)
    (HasAngle angle180 joint1)
    (HasAngle angle90 joint2)
    (HasAngle angle45 joint3)
    (HasAngle angle135 joint4)
    (HasAngle angle180 joint5)
    (HasAngle angle225 joint6)
    (HasAngle angle135 joint7)
    (HasAngle angle315 joint8)
    (HasAngle angle90 joint9)
    )
)
)

; plan
1. (decrease_angle link10 link9 joint9 angle135 angle90)
   deleted: (hasangle angle135 joint9)
   added: (hasangle angle90 joint9)
   goals met: 1 of 10
2. (decrease_angle link2 link1 joint1 angle315 angle270)
   deleted: (hasangle angle315 joint1)
   added: (hasangle angle270 joint1)
   goals met: 1 of 10
3. (decrease_angle link4 link3 joint3 angle90 angle45)
   deleted: (hasangle angle90 joint3)
   added: (hasangle angle45 joint3)
   goals met: 2 of 10
4. (decrease_angle link5 link4 joint4 angle225 angle180)
   deleted: (hasangle angle225 joint4)
   added: (hasangle angle180 joint4)
   goals met: 2 of 10
5. (decrease_angle link9 link8 joint8 angle45 angle0)
   deleted: (hasangle angle45 joint8)
   added: (hasangle angle0 joint8)
   goals met: 2 of 10
6. (increase_angle link1 link_ground joint_ground angle315 angle0)
   deleted: (hasangle angle315 joint_ground)
   added: (hasangle angle0 joint_ground)
   goals met: 2 of 10
7. (increase_angle link3 link2 joint2 angle0 angle45)
   deleted: (hasangle angle0 joint2)
   added: (hasangle angle45 joint2)
   goals met: 2 of 10
8. (increase_angle link6 link5 joint5 angle0 angle45)
   deleted: (hasangle angle0 joint5)
   added: (hasangle angle45 joint5)
   goals met: 2 of 10
9. (increase_angle link7 link6 joint6 angle45 angle90)
   deleted: (hasangle angle45 joint6)
   added: (hasangle angle90 joint6)
   goals met: 2 of 10
10. (increase_angle link8 link7 joint7 angle0 angle45)
   deleted: (hasangle angle0 joint7)
   added: (hasangle angle45 joint7)
   goals met: 2 of 10
11. (decrease_angle link2 link1 joint1 angle270 angle225)
   deleted: (hasangle angle270 joint1)
   added: (hasangle angle225 joint1)
   goals met: 2 of 10
12. (decrease_angle link5 link4 joint4 angle180 angle135)
   deleted: (hasangle angle180 joint4)
   added: (hasangle angle135 joint4)
   goals met: 3 of 10
13. (decrease_angle link9 link8 joint8 angle0 angle315)
   deleted: (hasangle angle0 joint8)
   added: (hasangle angle315 joint8)
   goals met: 4 of 10
14. (increase_angle link1 link_ground joint_ground angle0 angle45)
   deleted: (hasangle angle0 joint_ground)
   added: (hasangle angle45 joint_ground)
   goals met: 4 of 10
15. (increase_angle link3 link2 joint2 angle45 angle90)
   deleted: (hasangle angle45 joint2)
   added: (hasangle angle90 joint2)
   goals met: 5 of 10
16. (increase_angle link6 link5 joint5 angle45 angle90)
   deleted: (hasangle angle45 joint5)
   added: (hasangle angle90 joint5)
   goals met: 5 of 10
17. (increase_angle link7 link6 joint6 angle90 angle135)
   deleted: (hasangle angle90 joint6)
   added: (hasangle angle135 joint6)
   goals met: 5 of 10
18. (increase_angle link8 link7 joint7 angle45 angle90)
   deleted: (hasangle angle45 joint7)
   added: (hasangle angle90 joint7)
   goals met: 5 of 10
19. (decrease_angle link2 link1 joint1 angle225 angle180)
   deleted: (hasangle angle225 joint1)
   added: (hasangle angle180 joint1)
   goals met: 6 of 10
20. (increase_angle link1 link_ground joint_ground angle45 angle90)
   deleted: (hasangle angle45 joint_ground)
   added: (hasangle angle90 joint_ground)
   goals met: 6 of 10
21. (increase_angle link6 link5 joint5 angle90 angle135)
   deleted: (hasangle angle90 joint5)
   added: (hasangle angle135 joint5)
   goals met: 6 of 10
22. (increase_angle link7 link6 joint6 angle135 angle180)
   deleted: (hasangle angle135 joint6)
   added: (hasangle angle180 joint6)
   goals met: 6 of 10
23. (increase_angle link8 link7 joint7 angle90 angle135)
   deleted: (hasangle angle90 joint7)
   added: (hasangle angle135 joint7)
   goals met: 7 of 10
24. (increase_angle link1 link_ground joint_ground angle90 angle135)
   deleted: (hasangle angle90 joint_ground)
   added: (hasangle angle135 joint_ground)
   goals met: 8 of 10
25. (increase_angle link6 link5 joint5 angle135 angle180)
   deleted: (hasangle angle135 joint5)
   added: (hasangle angle180 joint5)
   goals met: 9 of 10
26. (increase_angle link7 link6 joint6 angle180 angle225)
   deleted: (hasangle angle180 joint6)
   added: (hasangle angle225 joint6)
   goals met: 10 of 10
